In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [251]:
train_data = pd.read_csv("train.csv")
test_data = pd.read_csv("test.csv")
all_data = pd.read_csv("titanic.csv", delimiter=';')

In [279]:
all_data = all_data.rename(columns={'name':'Name', 'ticket':'Ticket'}).sort_values(by=["Name"]).reset_index(drop=True)
all_data["Name"] = all_data["Name"].map(lambda x: x.replace('"', ''))

print all_data.shape
all_data.head()

(1309, 14)

,pclass,survived,Name,sex,age,sibsp,parch,Ticket,Fare,cabin,embarked,boat,body,home.dest
0,3,0,"Abbing, Mr. Anthony",male,42,0,0,C.A. 5547,"7,5500",NaN,S,NaN,NaN,NaN
1,3,0,"Abbott, Master. Eugene Joseph",male,13,0,2,C.A. 2673,"20,2500",NaN,S,NaN,NaN,"East Providence, RI"
2,3,0,"Abbott, Mr. Rossmore Edward",male,16,1,1,C.A. 2673,"20,2500",NaN,S,NaN,190.0,"East Providence, RI"
3,3,1,"Abbott, Mrs. Stanton (Rosa Hunt)",female,35,1,1,C.A. 2673,"20,2500",NaN,S,A,NaN,"East Providence, RI"
4,3,1,"Abelseth, Miss. Karen Marie",female,16,0,0,348125,"7,6500",NaN,S,16,NaN,"Norway Los Angeles, CA"

In [257]:
k_data = pd.concat([train_data, test_data]).sort_values(by=["Name"]).reset_index(drop=True)
k_data["Name"] = k_data["Name"].map(lambda x: x.replace('"', ''))


print k_data.shape
k_data.head()

(1309, 12)

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
0,42.0,NaN,S,7.55,"Abbing, Mr. Anthony",0,846,3,male,0,0.0,C.A. 5547
1,13.0,NaN,S,20.25,"Abbott, Master. Eugene Joseph",2,1284,3,male,0,NaN,C.A. 2673
2,16.0,NaN,S,20.25,"Abbott, Mr. Rossmore Edward",1,747,3,male,1,0.0,C.A. 2673
3,35.0,NaN,S,20.25,"Abbott, Mrs. Stanton (Rosa Hunt)",1,280,3,female,1,1.0,C.A. 2673
4,16.0,NaN,S,7.65,"Abelseth, Miss. Karen Marie",0,1237,3,female,0,NaN,348125

In [281]:
pd.merge(k_data, all_data, on=['Name', 'Ticket']).shape

(1309, 24)

In [289]:
output = pd.merge(k_data, all_data, on=['Name', 'Ticket'])[["PassengerId", "survived"]].sort_values(by="PassengerId").reset_index(drop=True)[891:]

In [290]:
output.to_csv('real_output.csv', index=False)